<template>
  <div class="home">
    <p class="mb-2">
      Всего необходимо реализовать 2 страницы: список космических кораблей и
      страницу корабля.
    </p>
    <p class="mb-2">Страница со списком кораблей:</p>
    <ul class="mb-2">
      <li>На странице будет список всех кораблей</li>
      <li>
        Добавить текстовое поле для поиска по названию корабля. Учесть
        возможность передачи результатов поиска по ссылке.
      </li>
      <li>Реализовать пагинацию в формате next - prev</li>
      <li>
        При клике по элементу списка, пользователь переходит на страницу с
        информацией по конкретному кораблю.
      </li>
    </ul>
    <p class="my-2">Страница корабля:</p>
    <ul>
      <li>Необходимо вывести всю информацию о корабле</li>
    </ul>
  </div>
</template>